/*-------------------------------------------------------------------------

 利息からの経過日数
 完全な経過日数とはならない可能性があるが、
 許容できる範囲の精度は保てる

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 define
---------------------------------------------------------------------------*/
//#define	DEBUG_POPUP_STRING

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;
using System.Collections.Generic;
using System.Text;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace gvtrademap_cs
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public class interest_days : gvo_day_counter
	{
		private setting						m_setting;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public interest_days(setting _setting)
			: base()
		{
			m_setting				= _setting;
			base.Days				= m_setting.interest_days;
		}

		/*-------------------------------------------------------------------------
		 更新
		---------------------------------------------------------------------------*/
		public void Update(int days, bool is_interest)
		{
			// 日数カウントの更新
			base.UpdateBase(days);

			if(is_interest){
				// 利息が来た
				base.Reset(days);		// カウンタリセット
			}

			// 設定保存用に覚えておく
			m_setting.interest_days		= base.get_true_days();
		}

		/*-------------------------------------------------------------------------
		 ポップアップ用の文字列を得る
		---------------------------------------------------------------------------*/
		public string GetPopupString()
		{
			if(GetDays() > 30){
				// 30日を超えてる
				// 
				return "30日以上経過しました\n現在の経過日数は信頼できません\n利息を受け取ると正常にもどります";
			}else{
#if DEBUG_POPUP_STRING
				return String.Format("残り{0}日\n{1}日航海中\n開始{2}\n現在{3}",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart,
										base.VoyageDaysStart,
										base.VoyageDays);
#else
				return String.Format("残り{0}日\n{1}日航海中",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart);
#endif
			}
		}
	}
}
